# -*- mode: org; mode: auto-fill -*-
#+TITLE:	Org Babelで文芸的プログラミング
#+category:	posts
#+layout:	post

(This is a post for the [[http://qiita.com/advent-calendar/2014/emacs][Emacs Advent Calendar 2014]] from Japan, a similar English version can be found [[http://literateinfrastructure.org/posts/2014/12/12/using-org-babel-for-lp/][here]])

Org modeの話を聞いたことがある方は、Org modeは「TODOリスト管理ツールの
一つだ」と思われる方が多いかもしれません。それはその通りですが、
Org Babelというモードで、「文芸的プログラミング(Literate Programming)」を実現することができます。

# Most people that have heard about Org mode are aware that
# it is a tool meant for creating =TODO= lists, taking notes,
# and even doing documentation to some extent.

# What is not immediately clear about Org mode is that it is a very
# powerful tool for doing literate programming and a comfortable
# environment for working with active documents.

# Rather than explain the ideas one by one, I will give a more 
# practical example of what it is possible to do with it.

Org Babelの使い方を示すために、あるホストのモニタリング情報を表示する、
単純なSinatraアプリケーションを例えにします。

*** 例: ホストのモニタリング情報を表示するSinatra app

表示したい項目をシステムの =uptime= と ESTABLISHEDコネクションの数に絞り込みます。

#+BEGIN_SRC sh :results output code
uptime

20:37  up 4 days,  9:48, 5 users, load averages: 0.67 0.86 1.11
#+END_SRC

=ESTABLISHED= コネクションの数:

#+begin_src sh :results output code
netstat -an | grep ESTABLISHED | wc -l

       5
#+END_SRC

この二つのコマンドの結果を集めて、 HTTPクライアントを使えば
=GET /vars= で取れるようになります：

#+BEGIN_SRC sh :results output
curl 127.0.0.1:9292/vars
#+END_SRC

#+RESULTS:
: Uptime:
: 21:04  up 4 days, 10:15, 5 users, load averages: 0.29 0.39 0.48
: 
: 
: ESTABLISHED connections:
:        6
: 
: 

